<HTML>
<HEAD>
<TITLE>Bare Bones HTML K&yacute;lavuzu: A&ccedil;&yacute;klamalar</TITLE>
</HEAD>
<BODY>

<hr>
<p>
<a name="HTML"><h2>HTML'in Geli&thorn;imi</h2></a>
</p>

<p>HTML, World Wide Web d&ouml;k&uuml;manlar&yacute; yaratmak i&ccedil;in kullan&yacute;lan sembolik bir dildir.
HTML &ouml;zellikleri bir s&uuml;reden beri geli&thorn;tirilmekte olmas&yacute;na ra&eth;men
baz&yacute; &ouml;zel web taray&yacute;c&yacute;lar&yacute;(browser) genel &ouml;zelliklere dahil edilmemi&thorn;
baz&yacute; komutlar&yacute; anlayabilmektedir.

Genelde kullan&yacute;c&yacute;lar &quot;T&uuml;m HTML komutlar&yacute;&quot;n&yacute;n listesini istediklerinde
asl&yacute;nda haz&yacute;rlad&yacute;klar&yacute; sayfalar&yacute;n ba&thorn;kalar&yacute; taraf&yacute;ndan kendi istedikleri yap&yacute;da
g&ouml;r&uuml;nmesini sa&eth;layacak komutlar&yacute; ifade ederler.


<em>Bare Bones HTML K&yacute;lavuzu</em> ise bu ihtiyac&yacute; kar&thorn;&yacute;lamak &uuml;zere tasarlanm&yacute;&thorn;t&yacute;r.

G&uuml;n&uuml;m&uuml;de kullan&yacute;lan temel web taray&yacute;c&yacute;lar&yacute; taraf&yacute;ndan desteklenen komutlar bir
araya getirilmesine ra&eth;men web taray&yacute;c&yacute;lar&yacute; aras&yacute;ndaki baz&yacute; ufak ayr&yacute;nt&yacute;lar &ccedil;ok
hassas bir bir d&ouml;k&uuml;man haz&yacute;rlanmas&yacute;n&yacute; engellemektedir.
</P>

<p>
HTML resmi standard&yacute; <a href="http://www.ietf.org/">Internet
Engineering Task Force</a> (IETF).  ile ba&eth;lant&yacute;l&yacute;
<a href="http://www.w3.org/">World Wide Web Consortium</a> (W3C)
taraf&yacute;ndan belirlenmektedir.

W3C, ba&thorn;ta HTML 2.0, HTML 3.0 en son HTML 3.2 olmak &uuml;zere HTML &ouml;zelliklerini
belirleyen s&uuml;r&uuml;mler sunmu&thorn;tur.

Buna ra&eth;men Netscape, Microsoft gibi kurumlar kendi web taray&yacute;c&yacute;lar&yacute;n&yacute;
yat&yacute;rken kendilerine has uzant&yacute;lar&yacute; bunlar&yacute;n i&ccedil;ine dahil etmelerine ra&eth;mem
bu uzant&yacute;lar HTML standardlar&yacute;n&yacute;n i&ccedil;inde yer alamam&yacute;&thorn;t&yacute;r.

<p>
<a href="http://www.w3.org/pub/WWW/MarkUp/html-spec/">HTML
2.0</a> d&ouml;k&uuml;man&yacute;nda, haziran 1994 tarihinde belirlenen temel standard
g&uuml;n&uuml;m&uuml;zde t&uuml;m web taray&yacute;c&yacute;lar&yacute; taraf&yacute;ndan (karakter tabanl&yacute; olanlar da dahil
olmak &uuml;zere) desteklenmektedir.

HTML 2.0 , cihazdan ba&eth;&yacute;ms&yacute;z olarak &ccedil;al&yacute;&thorn;an ve temel HTML kavram&yacute;n&yacute; belirleyen,
sayfalar&yacute;n t&uuml;m i&ccedil;eri&eth;inin  g&ouml;sterilmesi yerine
bilginin d&uuml;zeninin g&ouml;sterimine dayanan sembolik bir dildir.

Di&eth;er kullan&yacute;c&yacute;lar&yacute;n sayfan&yacute;zdaki her&thorn;eyi g&ouml;rmesini isterseniz HTML 2.0
komutlar&yacute;n&yacute; kullan&yacute;n&yacute;z.
</P>

<p>1995 y&yacute;l&yacute;nda sunulan <a href="http://www.w3.org/pub/WWW/MarkUp/html3/">HTML 3.0
draft</a>, temel olarak HTML 2.0 &uuml;zerine tablolama, metin ve grafikler ile ilgili
ilaveleri i&ccedil;ermektedir.

Baz&yacute; HTML 3.0 &ouml;zelliklerinin web taray&yacute;c&yacute;lar&yacute; taraf&yacute;ndan desteklenmesine
ra&eth;men baz&yacute;lar&yacute; ise desteklenmemi&thorn;tir.
Baz&yacute; durumlarda ise &quotresmi&quot komutlar yerine web taray&yacute;c&yacute;s&yacute; geli&thorn;tiren
firmalar&yacute;n bulduklar&yacute; alternatif  &ccedil;&ouml;z&uuml;mler daha yayg&yacute;n kullan&yacute;l&yacute;r olmu&thorn;tur.


HTML 3.0, zaman&yacute;n&yacute; doldurmu&thorn; olup  art&yacute;k resmi bir standard de&eth;ildir.
</p>

<p>May&yacute;s 1996 da W3C, genel olarak kabul g&ouml;rm&uuml;&thorn; deneyimleri g&ouml;z &ouml;n&uuml;ne alarak
<a href="http://www.w3.org/pub/WWW/MarkUp/Wilbur/">HTML 3.2
draft</a> &yacute; sunmustur.

Bu sayede HTML 3.2, Netscape ve Microsoft gibi web taray&yacute;c&yacute;s&yacute; yaz&yacute;l&yacute;m&yacute; &uuml;reten
firmalar&yacute;n HTML 3.0  komutlar&yacute;na ek olarak geli&thorn;tirdikleri komutlar&yacute; da i&ccedil;erir
hale gelmi&thorn;tir.

W3C'nin, <a href="http://www.w3.org/pub/WWW/MarkUp/Activity">Position
Statement on HTML</a> d&ouml;k&uuml;man&yacute;nda belirti&eth;i gibi ,bilgi sa&eth;lay&yacute;c&yacute;lar&yacute;n
HTML 3.2 &ouml;zelliklerini kullanmas&yacute; tavsiye edilmektedir.


Bundan dolay&yacute; Bare Bones HTML K&yacute;lavuzunun 3.0 Uyarlamas&yacute; t&uuml;m HTML 3.2 komutlar&yacute;n&yacute;
i&ccedil;ermektedir.
Temel web taray&yacute;c&yacute;lar&yacute;n&yacute;n hali haz&yacute;rda kullan&yacute;lan s&uuml;r&uuml;mleri bu komutlar&yacute;n hepsini
g&ouml;r&uuml;n&uuml;&thorn;te desteklemektedir.
</P>


<p>Netscape ve Microsoft taraf&yacute;ndan kullan&yacute;lan baz&yacute; uzant&yacute;lar
ya yayg&yacute;n kullan&yacute;ma sahip olmad&yacute;klar&yacute; yada
HTML 3.2 &ouml;zellikleri yaz&yacute;ld&yacute;ktan sonra ortaya at&yacute;ld&yacute;klar&yacute; i&ccedil;in
HTML 3.2 i&ccedil;erisinde yer almam&yacute;&thorn;lard&yacute;r.


Netscape Navigator'un HTML 3.0 destekleyen ilk web taray&yacute;c&yacute;s&yacute;
olmas&yacute; ve bu piyasan&yacute;n&yacute; %70 lik k&yacute;sm&yacute;n&yacute; elinde bulundurmas&yacute; nedeni ile
&lt;BLINK&gt; ve &ccedil;er&ccedil;eveler ile komutlar gibi baz&yacute; &ouml;zel uzant&yacute;lar
kullan&yacute;c&yacute;lar taraf&yacute;ndan hatal&yacute; bir &thorn;ekilde
HTML 3.0 veya HTML 3.2 nin par&ccedil;as&yacute; olarak g&ouml;r&uuml;nmektedir.
</p>


<p>
Netscape ve Microsofta ait uzant&yacute;lar&yacute; kullan&yacute;rken bu firmalar&yacute;n
web taray&yacute;c&yacute;lar&yacute;n&yacute; kullanmayanlar&yacute;n haz&yacute;rlad&yacute;&eth;&yacute;n&yacute;z sayfalar&yacute;
sizin g&ouml;r&uuml;nmesini istedi&eth;iniz gibi g&ouml;remeyeceklerini hat&yacute;r&yacute;n&yacute;zda tutunuz.

Ayn&yacute; zamanda standard olmayan komutlar&yacute;n ileriki s&uuml;r&uuml;mlerde desteklenece&eth;inin
hi&ccedil;bir garantisi olmad&yacute;&eth;&yacute;n&yacute; dikkate al&yacute;n&yacute;z.

K&yacute;sacas&yacute; Netscape ve Microsofta ait uzant&yacute;lar&yacute; kullanmak sizin se&ccedil;iminizdir.

Baz&yacute;lar&yacute; standard olan ile olmayan komutlar aras&yacute;ndan hangilerini
kullanacaklar&yacute; aras&yacute;nda ikileme d&uuml;&thorn;mektedirler.
Benim g&ouml;r&uuml;&thorn;&uuml;m ise aralar&yacute;ndaki farklar&yacute; bildi&eth;iniz s&uuml;rece size en kolay gelen
ve sizin hitab ettiginiz kesime en uygun olanlar&yacute; kullanman&yacute;zd&yacute;r.

Bare Bones HTML K&yacute;lavuzu bu felsefeyi yans&yacute;tmaktad&yacute;r. K&yacute;lavuz
sadece resmi &ouml;zellikleri g&ouml;stermek yerine yayg&yacute;n kullan&yacute;m&yacute; olan komutlar
ve bunlar&yacute;n ba&eth;l&yacute; bulunduklar&yacute; standardlar hakk&yacute;nda bir fikir vermek &uuml;zere
haz&yacute;rlanm&yacute;&thorn;t&yacute;r.
<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p>


<hr>
<br>
<a name="prologue"><h2>&Ouml;ns&ouml;z</h2></a>

<p>&Ouml;ns&ouml;z&uuml;n dosyan&yacute;z&yacute;n en ba&thorn;&yacute;nda bulunmas&yacute; gereklidir. Web taray&yacute;c&yacute;lar&yacute;n&yacute;n HTML
d&ouml;k&uuml;man&yacute;n&yacute; tan&yacute;yabilmesi i&ccedil;in &ouml;ns&ouml;z gerekli de&eth;ildir.

&Ouml;ns&ouml;z&uuml;n format&yacute; kullan&yacute;lan HTML d&ouml;k&uuml;man tipi tan&yacute;mlamas&yacute;na ba&eth;l&yacute; olarak
de&eth;i&thorn;iklik g&ouml;stermektedir.
</p>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p>

<hr>
<br>

<a name="xmp"><h2>&lt;XMP&gt;</h2></a>

<p>&lt;XMP&gt; komutu tutars&yacute;z sonu&ccedil;lar &uuml;retti&eth;i i&ccedil;in kullan&yacute;mdan
kald&yacute;r&yacute;lm&yacute;&thorn;t&yacute;r.Onun yerine &lt;PRE&gt; komutu kullan&yacute;labilir.
</p>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p> 

<hr><br>

<a name="blockquote"><h2>&lt;BLOCKQUOTE&gt;</h2></a>

<p>HTML 2.0 '&yacute;n do&eth;rudan desteklemedi&eth;i i&ccedil;erden yazma
&ouml;zelli&eth;ini sa&eth;lamak &uuml;zere  (t&yacute;rnak i&ccedil;inde yaz&yacute;dan ziyade)
&lt;BLOCKQUOTE&gt; komutu kullan&yacute;lmaktad&yacute;r.
</p>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p> 
<hr><br>

<a name="align"><h2>Ayarlama Komutlar&yacute;</h2></a>

<p>HTML 3.2, Paragraf ve ba&thorn;l&yacute;k komutlar&yacute; i&ccedil;in ayarlamalar&yacute; desteklemektedir.
&lt;CENTER&gt; komutu esas olarak Netscape taraf&yacute;ndan geli&thorn;tirilmi&thorn;tir.
&lt;CENTER&gt; komutu g&uuml;n&uuml;m&uuml;zde Paragraf ve ba&thorn;l&yacute;k komutlar&yacute; i&ccedil;indeki ayarlamalar&yacute;
tan&yacute;mayan taray&yacute;c&yacute;lar ile Netscape de bir tablonun ortalanmas&yacute; gibi  ama&ccedil;lara hizmet
etmek &uuml;zere kullan&yacute;lmaktad&yacute;r.
</P>

<p>&lt;CENTER&gt; komutunun en b&uuml;y&uuml;k s&yacute;k&yacute;nt&yacute;s&yacute; ortalanm&yacute;&thorn; bilgiyi takiben
bir paragraf yaratmas&yacute; ve bunun &lt;CENTER&gt; komutunu tan&yacute;mayan
baz&yacute; web taray&yacute;c&yacute;lar&yacute; taraf&yacute;ndan uygulanmamas&yacute;d&yacute;r.
Her ge&ccedil;en g&uuml;n web taray&yacute;c&yacute;lar&yacute; &lt;P ALIGN=CENTER&gt;&lt;/P&gt; &thorn;eklinde kullan&yacute;lan
ayarlar&yacute; kabul ettiklerine g&ouml;re standard olmayan &lt;CENTER&gt; komutu yerine
bu t&uuml;r kullan&yacute;mlar&yacute; tercih etmek gerekir.
</P>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p> 
<hr><br>

<a name="paragraph"><h2>&lt;P&gt; Komutu</h2></a>

<p>
Pek&ccedil;ok HTML komutu ba&thorn;lan&eth;&yacute;&ccedil; komutu , metin  ve biti&thorn; komutu olarak kullan&yacute;lmaktad&yacute;r.
(&ouml;rnegin &lt;B&gt;Bu bir koyu yaz&yacute;d&yacute;r&lt;/B&gt;).
&lt;P&gt; komutu ise bunlar&yacute;n aksine sadece ba&thorn;lang&yacute;&thorn;ta yer almaktad&yacute;r.

Ancak bu kullan&yacute;m paragraflar&yacute;n sola, sa&eth;a dayal&yacute; yada ortalanm&yacute;&thorn; olarak
g&ouml;sterilmesine imkan verememektedir.
Zira metinin nerede ba&thorn;lay&yacute;p nerede sona erdi&eth;i bilinememektedir.

Bu nedenle  HTML 3.0 sunusunun ba&thorn;&yacute;nadan beri
&lt;P&gt;bir metin &lt;/P&gt;, &thorn;eklinde kullan&yacute;m desteklenmis ve
&lt;P&gt; komutunun ayarlamaya y&ouml;nelik komutlar&yacute; ta&thorn;&yacute;mas&yacute;na karar verilmistir.
</p>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p>

<hr><br
<a name="tables"><h2>Tablo Komutlar&yacute;</h2></a>

<p>Tablo komutlar&yacute; hakk&yacute;nda halen bir tart&yacute;&thorn;ma s&uuml;rmektedir.
(&Ouml;zelliklede Netscape'in ortaya att&yacute;&eth;&yacute; tablo ve kolon geni&thorn;liklerinin
y&uuml;zde ve pixel cinsinden ifade edilmesi konusunda.)
Ancak bunun d&yacute;&thorn;&yacute;nda kalan k&yacute;s&yacute;mlarda, tablolar g&uuml;n&uuml;m&uuml;z de yayg&yacute;n kullan&yacute;lan
web taray&yacute;c&yacute;lar&yacute; taraf&yacute;ndan benzer &thorn;ekillerde de&eth;erlendirilmektedirler.
</p>

<p align=center>
<a href="tr_bbv30.html">K&yacute;lavuza D&ouml;n</a>
</p> 
<hr>

<p align=center>Copyright &#169; 1995-1997 Kevin Werbach.<br>
Son G&uuml;ncelleme Temmuz 20, 1996.</p>
</BODY>
</HTML>
